import type { Terms } from "@/types/terms";

export const politics: Terms = {
  date: "2026-08-01",
  sections: [
    {
      title: "1. Общие положения",
      content: [
        "1.1. Настоящая Политика конфиденциальности (далее — «Политика») регулирует порядок обработки и защиты информации, которую Пользователь передаёт при использовании сервиса https://mindbodyhub.pro/ (далее — «Сервис»).",
        "1.2. Используя Сервис, Пользователь подтверждает своё согласие с условиями Политики. Если Пользователь не согласен с условиями — он обязан прекратить использование Сервиса.",
      ],
    },
    {
      title: "2. Сбор информации",
      content: [
        "2.1. Сервис может собирать следующие типы данных:",
        "- идентификаторы аккаунта (логин, ID, никнейм и т.п.);",
        "- техническую информацию (IP-адрес, данные о браузере, устройстве и операционной системе);",
        "- историю взаимодействий с Сервисом.",
        "2.2. Сервис не требует от Пользователя предоставления паспортных данных, документов, фотографий или другой личной информации, кроме минимально необходимой для работы.",
      ],
    },
    {
      title: "3. Использование информации",
      content: [
        "3.1. Сервис может использовать полученную информацию исключительно для:",
        "- обеспечения работы функционала;",
        "- связи с Пользователем (в том числе для уведомлений и поддержки);",
        "- анализа и улучшения работы Сервиса.",
      ],
    },
    {
      title: "4. Передача информации третьим лицам",
      content: [
        "4.1. Администрация не передаёт полученные данные третьим лицам, за исключением случаев:",
        "- если это требуется по закону;",
        "- если это необходимо для исполнения обязательств перед Пользователем (например, при работе с платёжными системами);",
        "- если Пользователь сам дал на это согласие.",
      ],
    },
    {
      title: "5. Хранение и защита данных",
      content: [
        "5.1. Данные хранятся в течение срока, необходимого для достижения целей обработки.",
        "5.2. Администрация принимает разумные меры для защиты данных, но не гарантирует абсолютную безопасность информации при передаче через интернет.",
      ],
    },
    {
      title: "6. Отказ от ответственности",
      content: [
        "6.1. Пользователь понимает и соглашается, что передача информации через интернет всегда сопряжена с рисками.",
        "6.2. Администрация не несёт ответственности за утрату, кражу или раскрытие данных, если это произошло по вине третьих лиц или самого Пользователя.",
       ],
    },
    {
      title: "7. Изменения в Политике",
      content: [
        "7.1. Администрация вправе изменять условия Политики без предварительного уведомления.",
        "7.2. Продолжение использования Сервиса после внесения изменений означает согласие Пользователя с новой редакцией Политики.",
      ],
    },
  ],
};
